zephyrproject-rtos/zephyr/drivers/pinmux/stm32/pinmux_stm32g041x.h
/*
 * Copyright (c) 2020 Framework Computer - Kieran Levin <ktl@frame.work> 
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef ZEPHYR_DRIVERS_PINMUX_STM32_PINMUX_STM32G041_H_
#define ZEPHYR_DRIVERS_PINMUX_STM32_PINMUX_STM32G041_H_

/**
 * alternate function mapping for STM32G041x8/xB
 * @file Header for STM32G0 pin multiplexing helper
 * 
 * 
 * 
 * **/

#define STM32G0_PINMUX_FUNC_PA0_SPI2_SCK \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA0_USART2_CTS \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA0_TIM2_CH1_ETR \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA0_LPTIM1_OUT \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA1_SPI1_SCK__ \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA1_I2S1_CK \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA1_USART2_RTS \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA1__DE_CK \
        (STM32_PINMUX_ALT_FUNC_3 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA1_TIM2_CH2 \
        (STM32_PINMUX_ALT_FUNC_4 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA1_I2C1_SMBA \
        (STM32_PINMUX_ALT_FUNC_8 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PA1_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_9 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA2_SPI1_MOSI__ \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA2_I2S1_SD \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA2_USART2_TX \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA2_TIM2_CH3 \
        (STM32_PINMUX_ALT_FUNC_3 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA2_LPUART1_TX \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA3_SPI2_MISO \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA3_USART2_RX \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA3_TIM2_CH4 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA3_LPUART1_RX \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA3_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA4_SPI1_NSS__ \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA4_I2S1_WS \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA4_SPI2_MOSI \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA4_TIM14_CH1 \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA4_LPTIM2_OUT \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA4_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_8 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA5_SPI1_SCK__ \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA5_I2S1_CK \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA5_TIM2_CH1_ETR \
        (STM32_PINMUX_ALT_FUNC_3 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA5_LPTIM2_ETR \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA5_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_8 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA6_SPI1_MISO__ \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA6_I2S1_MCK \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA6_TIM3_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA6_TIM1_BKIN \
        (STM32_PINMUX_ALT_FUNC_3 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA6_TIM16_CH1 \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA6_LPUART1_CTS \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA7_SPI1_MOSI__ \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA7_I2S1_SD \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA7_TIM3_CH2 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA7_TIM1_CH1N \
        (STM32_PINMUX_ALT_FUNC_3 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA7_TIM14_CH1 \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA7_TIM17_CH1 \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA8_MCO \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA8_SPI2_NSS \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA8_TIM1_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA8_LPTIM2_OUT \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA8_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA9_MCO \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA9_USART1_TX \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA9_TIM1_CH2 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA9_SPI2_MISO \
        (STM32_PINMUX_ALT_FUNC_4 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA9_I2C1_SCL \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PA9_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA10_SPI2_MOSI \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA10_USART1_RX \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA10_TIM1_CH3 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA10_TIM17_BKIN \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA10_I2C1_SDA \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PA10_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA11_SPI1_MISO__ \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA11_I2S1_MCK \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA11_USART1_CTS \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA11_TIM1_CH4 \
        (STM32_PINMUX_ALT_FUNC_3 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA11_TIM1_BKIN2 \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA11_I2C2_SCL \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PA12_SPI1_MOSI__ \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA12_I2S1_SD \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA12_USART1_RTS \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA12__DE_CK \
        (STM32_PINMUX_ALT_FUNC_3 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA12_TIM1_ETR \
        (STM32_PINMUX_ALT_FUNC_4 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA12_I2S_CKIN \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA12_I2C2_SDA \
        (STM32_PINMUX_ALT_FUNC_8 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PA13_SWDIO \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA13_IR_OUT \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA13_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA14_SWCLK \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA14_USART2_TX \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA14_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA15_SPI1_NSS__ \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA15_I2S1_WS \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA15_USART2_RX \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA15_TIM2_CH1_ETR \
        (STM32_PINMUX_ALT_FUNC_3 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PA15_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_8 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB0_SPI1_NSS__ \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB0_I2S1_WS \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB0_TIM3_CH3 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB0_TIM1_CH2N \
        (STM32_PINMUX_ALT_FUNC_3 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB0_LPTIM1_OUT \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB1_TIM14_CH1 \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB1_TIM3_CH4 \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB1_TIM1_CH3N \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB1_LPTIM2_IN1 \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB1_LPUART1_RTS \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB1__DE \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB1_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_8 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB2_SPI2_MISO \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB2_LPTIM1_OUT \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB2_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB3_SPI1_SCK__ \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB3_I2S1_CK \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB3_TIM1_CH2 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB3_TIM2_CH2 \
        (STM32_PINMUX_ALT_FUNC_3 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB3_USART1_RTS \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB3__DE_CK \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB3_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_9 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB4_SPI1_MISO__ \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB4_I2S1_MCK \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB4_TIM3_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB4_USART1_CTS \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB4_TIM17_BKIN \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB4_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_8 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB5_SPI1_MOSI__ \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB5_I2S1_SD \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB5_TIM3_CH2 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB5_TIM16_BKIN \
        (STM32_PINMUX_ALT_FUNC_3 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB5_LPTIM1_IN1 \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB5_I2C1_SMBA \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PB6_USART1_TX \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB6_TIM1_CH3 \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB6_TIM16_CH1N \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB6_SPI2_MISO \
        (STM32_PINMUX_ALT_FUNC_4 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB6_LPTIM1_ETR \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB6_I2C1_SCL \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PB6_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB7_USART1_RX \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB7_SPI2_MOSI \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB7_TIM17_CH1N \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB7_LPTIM1_IN2 \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB7_I2C1_SDA \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PB7_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB8_SPI2_SCK \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB8_TIM16_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB8_I2C1_SCL \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PB8_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB9_IR_OUT \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB9_TIM17_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB9_SPI2_NSS \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB9_I2C1_SDA \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PB9_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB10_LPUART1_RX \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB10_TIM2_CH3 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB10_SPI2_SCK \
        (STM32_PINMUX_ALT_FUNC_5 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB10_I2C2_SCL \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PB11_SPI2_MOSI \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB11_LPUART1_TX \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB11_TIM2_CH4 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB11_I2C2_SDA \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PB12_SPI2_NSS \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB12_LPUART1_RTS \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB12__DE \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB12_TIM1_BKIN \
        (STM32_PINMUX_ALT_FUNC_3 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB12_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_8 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB13_SPI2_SCK \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB13_LPUART1_CTS \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB13_TIM1_CH1N \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB13_I2C2_SCL \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PB13_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB14_SPI2_MISO \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB14_TIM1_CH2N \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB14_I2C2_SDA \
        (STM32_PINMUX_ALT_FUNC_6 | STM32_OTYPER_OPEN_DRAIN | STM32_PUPDR_PULL_UP)
#define STM32G0_PINMUX_FUNC_PB14_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB15_SPI2_MOSI \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB15_TIM1_CH3N \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PB15_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_7 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC6_TIM3_CH1 \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC6_TIM2_CH3 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC7_TIM3_CH2 \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC7_TIM2_CH4 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC13_TIM1_BKIN \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC14_TIM1_BKIN2 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC15_OSC32_EN \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PC15_OSC_EN \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD0_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD0_SPI2_NSS \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD0_TIM16_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD1_EVENTOUT \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD1_SPI2_SCK \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD1_TIM17_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD2_TIM3_ETR \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD2_TIM1_CH1N \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD3_USART2_CTS \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD3_SPI2_MISO \
        (STM32_PINMUX_ALT_FUNC_1 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PD3_TIM1_CH2N \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PF0_TIM14_CH1 \
        (STM32_PINMUX_ALT_FUNC_2 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PF1_OSC_EN \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)
#define STM32G0_PINMUX_FUNC_PF2_MCO \
        (STM32_PINMUX_ALT_FUNC_0 | STM32_OTYPER_PUSH_PULL | STM32_PUPDR_NO_PULL)

#endif /* ZEPHYR_DRIVERS_PINMUX_STM32_PINMUX_STM32G041_H_ */
